### mysql와 python의 연동
1. 라이브러리 설치
2. sql 서버의 정보 입력
3. sql 서버에 접속
4. sql 쿼리문을 이용하여 데이터를 CRUD 작업

In [1]:
### mysql 라이브러리 설치 
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\moons\appdata\local\programs\python\python36\lib\site-packages (1.0.2)

In [2]:
import pymysql 
import pandas as pd

In [3]:
## sql 서버 정보 입력 -> DB 접속
_db = pymysql.connect(
    user = 'root', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion', 
    port = 3306
)

In [50]:
## cursor 변수 
## sql 쿼리문을 실행 시키기 위해 만들어야되는 필수 변수
## DictCursor는 sql쿼리문이 실행되고 나온 데이터를 딕셔너리 형태로 받는다.
cursor = _db.cursor(pymysql.cursors.DictCursor)

In [51]:
sql = """
        select 
        * 
        from 
        user_info
      """

cursor.execute(sql)

result = cursor.fetchall()
print(result)

[{'id': '1', 'name': '2', 'age': 3, 'address': '4'}, {'id': '3145', 'name': '1243', 'age': 123, 'address': '124'}, {'id': '5', 'name': '5', 'age': 5, 'address': '5'}, {'id': 'abc', 'name': '30', 'age': 20, 'address': 'ubion11'}, {'id': 'good', 'name': 'hello', 'age': 25, 'address': 'ubion'}, {'id': 'Hello', 'name': 'Would', 'age': 777777, 'address': 'ubion'}, {'id': 'Hi', 'name': 'hello', 'age': 99999, 'address': 'jip'}, {'id': 'mae', 'name': 'rong', 'age': 123214, 'address': 'street'}, {'id': 'test', 'name': 'moon', 'age': None, 'address': 'ubion'}, {'id': 'test10', 'name': 'new', 'age': 99, 'address': 'house'}, {'id': 'test11', 'name': 'park', 'age': 40, 'address': 'ubion10'}, {'id': 'test2', 'name': 'kim', 'age': 30, 'address': 'ubion'}, {'id': 'test4', 'name': 'park', 'age': 30, 'address': 'ubion2'}, {'id': 'test9', 'name': 'lee', 'age': 25, 'address': 'ubion5'}, {'id': '안녕하세요', 'name': '한번', 'age': 100, 'address': 'ubion'}]

In [52]:
pd.DataFrame(result)

        id   name       age  address
0        1      2       3.0        4
1     3145   1243     123.0      124
2        5      5       5.0        5
3      abc     30      20.0  ubion11
4     good  hello      25.0    ubion
5    Hello  Would  777777.0    ubion
6       Hi  hello   99999.0      jip
7      mae   rong  123214.0   street
8     test   moon       NaN    ubion
9   test10    new      99.0    house
10  test11   park      40.0  ubion10
11   test2    kim      30.0    ubion
12   test4   park      30.0   ubion2
13   test9    lee      25.0   ubion5
14   안녕하세요     한번     100.0    ubion

In [7]:
sql = """
        insert into 
        user_info(id, name, age) 
        values 
        ('test2', 'kim', 30)
"""
cursor.execute(sql)

1

In [8]:
_db.commit()

In [9]:
sql = """
        select 
        createDt as 날짜, 
        deathCnt as 사망자, 
        decideCnt as 확진자 
        from 
        corona 
        order by 
        createDt
"""

cursor.execute(sql)
result = cursor.fetchall()
df = pd.DataFrame(result)
df

                          날짜    사망자       확진자
0    2020-03-10 00:00:00.000     54      7513
1    2020-03-11 00:00:00.000     60      7755
2    2020-03-12 00:00:00.000     66      7869
3    2020-03-13 00:00:00.000     67      7979
4    2020-03-14 00:00:00.000     72      8086
..                       ...    ...       ...
815  2022-06-04 08:56:49.219  24238  18153814
816  2022-06-05 08:53:19.426  24258  18163648
817  2022-06-06 09:00:06.734  24279  18168670
818  2022-06-07 09:09:00.897  24299  18174842
819  2022-06-08 09:09:05.982  24305  18188200

[820 rows x 3 columns]

### sql 쿼리문 실행 함수 생성
1. select() 함수 생성
2. 매개변수는 2개 
3. 매개변수 sql은 sql 쿼리문을 입력 받는 변수
4. 매개변수 limit는 기본값은 0 
5. limit가 0인 경우는 쿼리문의 결과를 전부 보여주고 0이 아닌 경우에는 limit의 개수만큼 행을 보여준다. 
6. sql 쿼리문을 받아서 실행하고 결과값을 데이터프레임으로 만들어서 리턴

In [38]:
def select(sql, limit = 0):
    # cursor.execute(sql)
    # result = cursor.fetchall()
    ## case1
    # if limit != 0:
    #     result = result[:limit]
    # df = pd.DataFrame(result)
    
    ## case 2
    # if limit != 0:
    #     df = pd.DataFrame(result).head(limit)
    # else :
    #     df = pd.DataFrame(result)

    # case3
    if limit != 0:
        sql = sql + " limit " + str(limit)
        
    cursor.execute(sql)
    result = cursor.fetchall()
    df = pd.DataFrame(result)
    

    return df


sql = """
        select * from corona
"""

select(sql, 10)

InterfaceError: (0, '')

### input을 이용하여 입력받은 데이터 값을 insert
1. input 함수를 이용하여 데이터를 4개를 받는다. 
2. insert문을 이용하여 user_info 테이블에 id, name, age, address 항목에 삽입

In [33]:
_id = input("id : ")
_name = input("name : ")
_age = input("age : ")
_address = input("address : ")

sql = f"""
    insert into 
    user_info 
    values 
    ('{_id}', '{_name}', '{_age}', '{_address}')
"""
# print(sql)
# cursor.execute(sql, [_id,_name,_age,_address])
cursor.execute(sql)
_db.commit()

In [53]:
## 데이터베이스와의 접속을 종료
_db.close()

In [49]:
## 외부의 있는 서버와의 접속
## root아이디는 내부에서만 접속이 가능한 아이디
_db = pymysql.connect(
    user = 'ubion', 
    password = '1234', 
    host = 'localhost', 
    db = 'ubion', 
    port = 3306
)